The Series Data Structure

In [1]:
import pandas as pd

In [2]:
s = ['kkk', 'mmm', 'sss']
pd.Series(s)

0    kkk
1    mmm
2    sss
dtype: object

In [4]:
num = [1,2,3,4,]
pd.Series(num)

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
stu = {'khalid': 'Math', 'ali': 'Chem', 'soso': 'Eng'}

s = pd.Series(stu)
s

khalid    Math
ali       Chem
soso       Eng
dtype: object

In [6]:
s.index

Index(['khalid', 'ali', 'soso'], dtype='object')

In [7]:
sut = [('ddd', 'sss'), ('eee', 'www'), ('fff', 'lll')]
pd.Series(sut)

0    (ddd, sss)
1    (eee, www)
2    (fff, lll)
dtype: object

In [8]:
s = pd.Series(['Math','Chem','Eng'], ['khalid', 'ali', 'soso'])
s

khalid    Math
ali       Chem
soso       Eng
dtype: object

In [10]:
sut = {'ddd': 'sss','eee': 'www','fff': 'lll'}
s = pd.Series(sut, index=['Khalid', 'Ali', 'Khalid11'])
s

Khalid      NaN
Ali         NaN
Khalid11    NaN
dtype: object

Querying a Series

In [11]:
stu = {'khalid': 'Math', 'ali': 'Chem', 'soso': 'Eng', 'Ali': 'Chem1'}

s = pd.Series(stu)
s

khalid     Math
ali        Chem
soso        Eng
Ali       Chem1
dtype: object

In [14]:
s.iloc[3]

'Chem1'

In [15]:
s.loc['ali']

'Chem'

In [19]:
g = [100,200,301,400,500]

total =0
for grade in g:
    total += grade
print(total/len(g))

300.2

In [20]:
import numpy as np
num = pd.Series(np.random.randint(0,1000,10000))

In [22]:
num.head()

0    496
1    950
2    479
3    873
4    707
dtype: int32

In [23]:
len(num)

10000

In [27]:
%%timeit -n 100
# Magic function

total = 0

g = [100,200,301,400,500]

total =0
for grade in g:
    total += grade

total/len(g)

374 ns ± 6.04 ns per loop (mean ± std. dev. of 7 runs, 100 loops each)

DataFrame Data Structure

In [1]:
import pandas as pd

r1 = pd.Series({
    'name': 'kkk',
    'class': 'math',
    'score': 88
})

r2 = pd.Series({
    'name': 'mmm',
    'class': 'phys',
    'score': 90
})

r3 = pd.Series({
    'name': 'aaa',
    'class': 'chem',
    'score': 95
})

In [3]:
df = pd.DataFrame([r1,r2,r3], index =['s1', 's2', 's3'])
df

   name class  score
s1  kkk  math     88
s2  mmm  phys     90
s3  aaa  chem     95

In [4]:
df = pd.read_csv('./data/Admission_Predict.csv')

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [27]:
df = pd.read_csv('./data/Admission_Predict.csv', index_col=0
)
df.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [28]:
new_df = df.rename(columns={
    'GRE Score': 'GRE Score', 'TOEFL Score':'TOEFL Score','University Rating':'University Rating',
    'SOP': 'Statemenr of Purpose', 'LOR':'Letter of Recommendation',
    'CGPA':'CGPA', 'Research':'Research', 'Chance of Admit':'Chance of Admit'})

In [38]:
new_df=df.rename(columns={'GRE Score':'GRE Score', 'TOEFL Score':'TOEFL Score',
                   'University Rating':'University Rating', 
                   'SOP': 'Statement of Purpose','LOR ': 'Letter of Recommendation',
                   'CGPA':'CGPA', 'Research':'Research',
                   'Chance of Admit':'Chance of Admit'})
new_df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,Letter of Recommendation,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [34]:
new_df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'Statement of Purpose',
       'Letter of Recommendation', 'CGPA', 'Research', 'Chance of Admit '],
      dtype='object')

In [39]:
df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP', 'LOR ', 'CGPA',
       'Research', 'Chance of Admit '],
      dtype='object')

In [40]:
# Lower case letters
cols = list(df.columns)
cols= [x.lower().strip() for x in cols]
df.columns= cols
df

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...
396,324,110,3,3.5,3.5,9.04,1,0.82
397,325,107,3,3.0,3.5,9.11,1,0.84
398,330,116,4,5.0,4.5,9.45,1,0.91
399,312,103,3,3.5,4.0,8.78,0,0.67
400,333,117,4,5.0,4.0,9.66,1,0.95

Querying a DataFrame